Тестовая_база_ERP_14/src/InformationRegisters/РЭЙ_КредитныйСиндикат/РЭЙ_КредитныйСиндикат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РЭЙ_КредитныйСиндикат</name>
  <resources>
    <name>СтранаКонтрагента</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Доля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/РЭЙ_КредитныйСиндикат/ManagerModule.bsl
Функция ПолучитьДанныеДляПечати(КонтрактВЭД) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РЭЙ_КредитныйСиндикат.Контрагент КАК Контрагент,
	|	РЭЙ_КредитныйСиндикат.СтранаКонтрагента КАК СтранаКонтрагента,
	|	РЭЙ_КредитныйСиндикат.Сумма КАК Сумма,
	|	РЭЙ_КредитныйСиндикат.Доля КАК Доля,
	|	РЭЙ_КредитныйСиндикат.СтранаКонтрагента.Код КАК СтранаКонтрагентаКод
	|ИЗ
	|	РегистрСведений.РЭЙ_КредитныйСиндикат КАК РЭЙ_КредитныйСиндикат
	|ГДЕ
	|	РЭЙ_КредитныйСиндикат.Договор = &КонтрактВЭД";
	Запрос.УстановитьПараметр("КонтрактВЭД", КонтрактВЭД);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Колонки.Добавить("НомерСтроки");
	Таблица.Колонки.Добавить("КонтрагентНаименование");
	текНомерСтроки = 0;
	Для Каждого СтрокаТЧ Из Таблица Цикл
		текНомерСтроки = текНомерСтроки + 1;
		СтрокаТЧ.НомерСтроки = текНомерСтроки;
		Если Не ПустаяСтрока(СтрокаТЧ.Контрагент.РЭЙ_НаименованиеАнгл) Тогда
			СтрокаТЧ.КонтрагентНаименование = СтрокаТЧ.Контрагент.РЭЙ_НаименованиеАнгл;
		ИначеЕсли Не ПустаяСтрока(СтрокаТЧ.Контрагент.НаименованиеПолное) Тогда
			СтрокаТЧ.КонтрагентНаименование = СтрокаТЧ.Контрагент.НаименованиеПолное;
		Иначе
			СтрокаТЧ.КонтрагентНаименование = СтрокаТЧ.Контрагент.Наименование;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Таблица;
КонецФункции
